// 基于准备好的dom，初始化echarts实例
var puf = echarts.init(document.getElementById('main'));

// 指定图表的配置项和数据
var hour = {
    tooltip: {
        trigger: 'axis'
    },
    color:['#0073B7','#00A65A','#F39C12'],
    legend: {
        left:'left',
        data:['PV','UV','分享']
    },
    toolbox: {
        show: true,
        feature: {
            magicType: {type: ['line', 'bar']},
            saveAsImage: {}
        }
    },
    calculable : true,
    xAxis:  {
        type: 'time',
        splitLine: {
            show: false
        }
    },
    yAxis: {
        type: 'value',
        axisLabel: {
            formatter: '{value}'
        }
    },
    dataZoom: [
        {   // 这个dataZoom组件，默认控制x轴。
            type: 'slider', // 这个 dataZoom 组件是 slider 型 dataZoom 组件
            start: 0,      // 左边在 10% 的位置。
            end: 50         // 右边在 60% 的位置。
        }
    ],
    series: [
        {
            name:'PV',
            type:'line',
            data:[
                {name:'2016/12/18 00:00', value:['2016/12/18 00:00', 11]},
                {name:'2016/12/18 01:00', value:['2016/12/18 01:00', 22]},
                {name:'2016/12/18 02:00', value:['2016/12/18 02:00', 35]},
                {name:'2016/12/18 03:00', value:['2016/12/18 03:00', 41]},
                {name:'2016/12/18 04:00', value:['2016/12/18 04:00', 60]},
                {name:'2016/12/18 05:00', value:['2016/12/18 05:00', 75]},
                {name:'2016/12/18 06:00', value:['2016/12/18 06:00', 80]},
                {name:'2016/12/18 07:00', value:['2016/12/18 07:00', 60]},
                {name:'2016/12/18 08:00', value:['2016/12/18 08:00', 50]},
                {name:'2016/12/18 09:00', value:['2016/12/18 09:00', 35]},
                {name:'2016/12/18 10:00', value:['2016/12/18 10:00', 30]},
                {name:'2016/12/18 11:00', value:['2016/12/18 11:00', 25]},
                {name:'2016/12/18 12:00', value:['2016/12/18 12:00', 51]},
                {name:'2016/12/18 13:00', value:['2016/12/18 13:00', 66]},
                {name:'2016/12/18 14:00', value:['2016/12/18 14:00', 77]},
                {name:'2016/12/18 15:00', value:['2016/12/18 15:00', 81]},
                {name:'2016/12/18 16:00', value:['2016/12/18 16:00', 73]},
                {name:'2016/12/18 17:00', value:['2016/12/18 17:00', 66]},
                {name:'2016/12/18 18:00', value:['2016/12/18 18:00', 52]},
                {name:'2016/12/18 19:00', value:['2016/12/18 19:00', 37]},
                {name:'2016/12/18 20:00', value:['2016/12/18 20:00', 31]},
                {name:'2016/12/18 21:00', value:['2016/12/18 21:00', 30]},
                {name:'2016/12/18 22:00', value:['2016/12/18 22:00', 20]},
                {name:'2016/12/18 23:00', value:['2016/12/18 23:00', 11]}
            ],
            smooth:true,
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        },
        {
            name:'UV',
            type:'line',
            smooth:true,
            data:[
                {name:'2016/12/18 00:00', value:['2016/12/18 00:00', 2]},
                {name:'2016/12/18 01:00', value:['2016/12/18 01:00', 8]},
                {name:'2016/12/18 02:00', value:['2016/12/18 02:00', 16]},
                {name:'2016/12/18 03:00', value:['2016/12/18 03:00', 20]},
                {name:'2016/12/18 04:00', value:['2016/12/18 04:00', 25]},
                {name:'2016/12/18 05:00', value:['2016/12/18 05:00', 28]},
                {name:'2016/12/18 06:00', value:['2016/12/18 06:00', 29]},
                {name:'2016/12/18 07:00', value:['2016/12/18 07:00', 30]},
                {name:'2016/12/18 08:00', value:['2016/12/18 08:00', 38]},
                {name:'2016/12/18 09:00', value:['2016/12/18 09:00', 40]},
                {name:'2016/12/18 10:00', value:['2016/12/18 10:00', 42]},
                {name:'2016/12/18 11:00', value:['2016/12/18 11:00', 46]},
                {name:'2016/12/18 12:00', value:['2016/12/18 12:00', 57]},
                {name:'2016/12/18 13:00', value:['2016/12/18 13:00', 60]},
                {name:'2016/12/18 14:00', value:['2016/12/18 14:00', 62]},
                {name:'2016/12/18 15:00', value:['2016/12/18 15:00', 67]},
                {name:'2016/12/18 16:00', value:['2016/12/18 16:00', 75]},
                {name:'2016/12/18 17:00', value:['2016/12/18 17:00', 78]},
                {name:'2016/12/18 18:00', value:['2016/12/18 18:00', 81]},
                {name:'2016/12/18 19:00', value:['2016/12/18 19:00', 88]},
                {name:'2016/12/18 20:00', value:['2016/12/18 20:00', 90]},
                {name:'2016/12/18 21:00', value:['2016/12/18 21:00', 95]},
                {name:'2016/12/18 22:00', value:['2016/12/18 22:00', 90]},
                {name:'2016/12/18 23:00', value:['2016/12/18 23:00', 92]}
            ],
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        },
        {
            name:'分享',
            type:'line',
            smooth:true,
            data:[
                {name:'2016/12/18 00:00', value:['2016/12/18 00:00', 0]},
                {name:'2016/12/18 01:00', value:['2016/12/18 01:00', 2]},
                {name:'2016/12/18 02:00', value:['2016/12/18 02:00', 9]},
                {name:'2016/12/18 03:00', value:['2016/12/18 03:00', 11]},
                {name:'2016/12/18 04:00', value:['2016/12/18 04:00', 16]},
                {name:'2016/12/18 05:00', value:['2016/12/18 05:00', 21]},
                {name:'2016/12/18 06:00', value:['2016/12/18 06:00', 22]},
                {name:'2016/12/18 07:00', value:['2016/12/18 07:00', 24]},
                {name:'2016/12/18 08:00', value:['2016/12/18 08:00', 27]},
                {name:'2016/12/18 09:00', value:['2016/12/18 09:00', 29]},
                {name:'2016/12/18 10:00', value:['2016/12/18 10:00', 33]},
                {name:'2016/12/18 11:00', value:['2016/12/18 11:00', 35]},
                {name:'2016/12/18 12:00', value:['2016/12/18 12:00', 36]},
                {name:'2016/12/18 13:00', value:['2016/12/18 13:00', 39]},
                {name:'2016/12/18 14:00', value:['2016/12/18 14:00', 45]},
                {name:'2016/12/18 15:00', value:['2016/12/18 15:00', 49]},
                {name:'2016/12/18 16:00', value:['2016/12/18 16:00', 51]},
                {name:'2016/12/18 17:00', value:['2016/12/18 17:00', 56]},
                {name:'2016/12/18 18:00', value:['2016/12/18 18:00', 61]},
                {name:'2016/12/18 19:00', value:['2016/12/18 19:00', 62]},
                {name:'2016/12/18 20:00', value:['2016/12/18 20:00', 67]},
                {name:'2016/12/18 21:00', value:['2016/12/18 21:00', 70]},
                {name:'2016/12/18 22:00', value:['2016/12/18 22:00', 73]},
                {name:'2016/12/18 23:00', value:['2016/12/18 23:00', 79]}
            ],
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        }
    ]
};

var day = {
    tooltip: {
        trigger: 'axis'
    },
    color:['#0073B7','#00A65A','#F39C12'],
    legend: {
        left:'left',
        data:['PV','UV','分享']
    },
    toolbox: {
        show: true,
        feature: {
            magicType: {type: ['line', 'bar']},
            saveAsImage: {}
        }
    },
    calculable : true,
    xAxis:  {
        type: 'category',
        boundaryGap: false,
        data: ['5.18','5.19','5.20','5.21','5.22','5.23','5.24']
    },
    yAxis: {
        bottom:'50%',
        type: 'value',
        axisLabel: {
            formatter: '{value}'
        }
    },
    series: [
        {
            name:'PV',
            type:'line',
            data:[10, 39, 50, 30, 21,20,8],
            smooth:true,
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        },
        {
            name:'UV',
            type:'line',
            smooth:true,
            data:[15, 27, 24, 31, 18, 12, 66],
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        },
        {
            name:'分享',
            type:'line',
            smooth:true,
            data:[31, 45, 40, 28, 11, 8, 13],
            markPoint: {
                data: [
                    {type: 'max', name: '最大值'}
                ]
            }
        }
    ]
};
puf.setOption(day);

var show = avalon.define({
    $id   :"show",
    onPUF : function(res){
        // 使用刚指定的配置项和数据显示图表。
        if (res === 'hour'){
            puf.setOption(hour);
        }else{
            puf.setOption(day);
        }
    }
});